{
  "Titles": {
    "home": "Головна: основна сторінка портфоліо",
    "about": "Про себе: інформація про мій досвід",
    "skills": "Навички: мої навички програмування",
    "projects": "Проекти: проекти, з якими я працював і працюю",
    "contacts": "Контакты: мои контакты"
  },
  "Menu": {
    "Home": "Головна",
    "About": "Про мене",
    "Skills": "Навички",
    "Projects": "Проекти",
    "Contacts": "Контакти"
  },
  "Home": {
    "hello": "Вітаю",
    "Iam": "Я ",
    "Andrei": "Андрій",
    "FED": "Front-end розробник",
    "AboutMe": "Про мене"
  },
  "About": {
    "mainM": "М",
    "name": "ене звати Андрій Хоменко.",
    "loveCode": "Я Front-End програміст. Я люблю писати код і ось мій шлях.",
    "stage": "Этап",
    "stage1": {
      "name": "Початок шляху",
      "date": "Грудень 2014 - Cерпень 2015",
      "textMain": {
        "0": "За порадою друга і наставника (досвідченого програміста) почав вивчати веб-програмування на",
        "1": ", а також на інших ресурсах, доступних в інтернеті. Отримавши перші знання,  одразу почав реалізовувати їх на практиці у власному проекті. "
      }
    },
    "stage2": {
      "name": "Перша робота",
      "date": "Серпень 2015 — Червень 2016",
      "textMain": {
        "0": "Компанія",
        "1": ". Займався розробкою парсера (скраппера)товарів з більш ніж 30 сайтів. Скраппер реалізовувався на PHP в ОПП з використанням шаблонів проектування.",
        "2": "Після успішного виконання задачі займався корзиною “з нуля”. Використовував Bootstrap, LESS, Query, Query UI, Ajax, Google API, а також AJAX и JSON для комунікації з сервером. Серверна частина реалізовувалась на PHP у зв'язці з MySQL. В той самий час познайомився з Gulp і також почав його використовувати. ",
        "3": "В останні місяці виконував багато завданнь по серверній частині і розмітці. У вільний час проходив курс CS50 -",
        "4": ". В компанії працював у скрам-команді. Маю досвід в DevOps і Azure."
      }
    },
    "stage3": {
      "name": "Перша Frontend",
      "date": "Липень 2016 — Жовтень 2016",
      "textMain": {
        "0": "Компанія",
        "1": ". В компанії працював саме фронт-енд розробником. Першою і основною моєю задачею була розмітка проекту під мобільні пристрої і оптимізація, розширення функціоналу Angular, здебільшого перехід на Component-based app архітектуру. В проекті працював з такими технологіями як Angular 1.5, Gulp, SASS, Bulma, Bootstrap 3, інколи jQuery. Робота організована по скрам. Контроль версії Git."
      }
    },
    "stage4": {
      "name": "Теперішній час",
      "date": "Жовтень 2016 - зараз",
      "textMain": {
        "0": "Компанія",
        "1": ". Посада Frontend-розробник. В роботі використовую наступні технології: ",
        "2": ", окрім основного ядра Angular також  Angular Material, Angular Cli, Angular Animations, Angular Universal, Webpack. Написання Unit тестів, а також тестів в контексті  Angular. Розмітка, SASS-метамова. Робота в скрам-команді, управління проектом через Jira."
      }
    }
  },
  "Skills": {
    "skills": "навички",
    "other": "Інші"
  },
  "Contacts": {
    "contacts": "Контакти",
    "sn": "Соціальні мережі",
    "sendmail": "Відправити лист",
    "subject": "Тема",
    "message": "Повідомлення",
    "subMessage": "Ви відправили:",
    "mailError": "Помилка, спробуйте знову!"
  }
}